<?php

return [
    'request' => '잘못된 요청입니다.',
    'format' => '유효하지 않은 형식입니다.',
    'length' => '허용된 최대길이(:length자)를 초과하였습니다.',
    'club' => '유효하지 않은 동아리아이디 입니다.',
    'account' => '유효하지 않은 사용자 아이디입니다.',
    'email' => '유효하지 않은 이메일 주소입니다.',
    'password' => '비밀번호는 영문/특수문자/숫자 모두 사용하여 9~16자로 작성해주세요.',
    'password_confirmed' => '비밀번호 확인이 일치하지 않습니다.',
    'ip' => '유효하지 않은 아이피입니다.',

    'file_id' => '유효하지 않은 파일번호입니다.',
    'user_id' => '유효하지 않은 사용자번호입니다.',
    'department_id' => '유효하지 않은 학과번호입니다.',
    'policy_id' => '유효하지 않은 정책 템플릿번호입니다.',
    'date' => '유효하지 않은 날짜입니다.',
    'title' => '제목을 입력해주세요.',
    'at_least_2_characters' => '최소 2자 이상 입력해주세요.',

    'club_code' => '유효하지 않은 동아리코드입니다.',
    'department_code' => '유효하지 않은 학과코드입니다.',
    'student_id' => '유효하지 않은 학번입니다.',
    'name' => '유효하지 않은 이름입니다.',
    'gender' => '성별이 정확하지 않습니다.',
    'phone' => '유효하지 않은 전화번호 형식입니다.',
    'email' => '유효하지 않은 이메일 형식입니다.',
    'address' => '유효하지 않은 주소입니다.',
    'birthday' => '유효하지 않은 생일입니다.',
];
